In [7]:
import pandas as pd
import numpy as np
from fuzzywuzzy import fuzz,process

In [8]:
# 常用设置
pd.set_option('display.width',200)  
pd.set_option('display.max_columns',50)

In [9]:
# header 代表标题位置
data = pd.read_excel('./sales.xlsx',sheet_name='sheet1',header=0)

In [12]:
# 前5
data.head()

   account                         name                                street             city          state  postal-code     Jan     Feb    Mar
0   211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway       New Jaycob          Texas        28752   10000   62000  35000
1   320563               Walter-Trantow                     1311 Alvis Tunnel    Port Khadijah  NorthCarolina        38365   95000   45000  35000
2   648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231   New Lilianland           Iowa        76517   91000  120000  35000
3   109996  D'Amore, Gleichner and Bode           155 Fadel Crescent Apt. 144       Hyattburgh          Maine        46021   45000  120000  10000
4   121213                Bauch-Goldner                   7274 Marissa Common  Shanahanchester     California        49681  162000  120000  35000

In [13]:
# 后5
data.tail()

    account                          name                     street             city        state  postal-code     Jan     Feb     Mar
10   214098   Goodwin, Homenick and Jerde  649 Cierra Forks Apt. 078         Rosaberg     Tenessee        47743   45000  120000   55000
11   231907                    Hahn-Moore   18115 Olivine Throughway    Norbertomouth  NorthDakota        31415  150000   10000  162000
12   242368  Frami, Anderson and Donnelly            182 Bertie Road      East Davian         Iowa        72686  162000  120000   35000
13   268755                   Walsh-Haley       2624 Beatty Parkways     Goodwinmouth  RhodeIsland        31919   55000  120000   35000
14   273274                 McDermott PLC      8917 Bergstrom Meadow  Kathryneborough     Delaware        27933  150000  120000   70000

In [14]:
data.dtypes

account         int64
name           object
street         object
city           object
state          object
postal-code     int64
Jan             int64
Feb             int64
Mar             int64
dtype: object

In [15]:
data.columns

Index(['account', 'name', 'street', 'city', 'state', 'postal-code', 'Jan', 'Feb', 'Mar'], dtype='object')

In [16]:
# 季度销售额
data['total'] = data['Jan'] + data['Feb'] + data['Mar']

In [17]:
data.head()

   account                         name                                street             city          state  postal-code     Jan     Feb    Mar   total
0   211829   Kerluke, Koepp and Hilpert                    34456 Sean Highway       New Jaycob          Texas        28752   10000   62000  35000  107000
1   320563               Walter-Trantow                     1311 Alvis Tunnel    Port Khadijah  NorthCarolina        38365   95000   45000  35000  175000
2   648336   Bashirian, Kunde and Price  62184 Schamberger Underpass Apt. 231   New Lilianland           Iowa        76517   91000  120000  35000  246000
3   109996  D'Amore, Gleichner and Bode           155 Fadel Crescent Apt. 144       Hyattburgh          Maine        46021   45000  120000  10000  175000
4   121213                Bauch-Goldner                   7274 Marissa Common  Shanahanchester     California        49681  162000  120000  35000  317000

In [23]:
data['total'].sum()

3686000

In [24]:
data['total'].min()

107000

In [25]:
data['total'].max()

340000

In [26]:
data['total'].mean()

245733.33333333334

In [30]:
# 新加求和行
res1 = data[['Jan','Feb','Mar','total']].sum()
res2 = pd.DataFrame(data=res1)

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

In [31]:
# 转换为dataframe
res2

             0
Jan    1462000
Feb    1507000
Mar     717000
total  3686000

In [32]:
# 转置矩阵
res2.T

       Jan      Feb     Mar    total
0  1462000  1507000  717000  3686000

In [34]:
# 转换为原始数据索引方式，缺失项用零填充
res2.T.reindex(columns=data.columns,fill_value=0)

   account  name  street  city  state  postal-code      Jan      Feb     Mar    total
0        0     0       0     0      0            0  1462000  1507000  717000  3686000

In [36]:
# 将新数据加入
data = data.append(res2.T.reindex(columns=data.columns,fill_value=0),ignore_index=True)

In [37]:
# 改索引名
data = data.rename(index={15:'Total'})

In [38]:
data.tail()

       account                          name                    street             city        state  postal-code      Jan      Feb     Mar    total
11      231907                    Hahn-Moore  18115 Olivine Throughway    Norbertomouth  NorthDakota        31415   150000    10000  162000   322000
12      242368  Frami, Anderson and Donnelly           182 Bertie Road      East Davian         Iowa        72686   162000   120000   35000   317000
13      268755                   Walsh-Haley      2624 Beatty Parkways     Goodwinmouth  RhodeIsland        31919    55000   120000   35000   210000
14      273274                 McDermott PLC     8917 Bergstrom Meadow  Kathryneborough     Delaware        27933   150000   120000   70000   340000
Total        0                             0                         0                0            0            0  1462000  1507000  717000  3686000

In [39]:
# 枚举函数使用 axis 1 行 axis 0 列 
data.apply(lambda x:x['state'],axis=1)

0                Texas
1        NorthCarolina
2                 Iowa
3                Maine
4           California
5             Arkansas
6           Mississipi
7          RhodeIsland
8         Pennsylvania
9                Idaho
10            Tenessee
11         NorthDakota
12                Iowa
13         RhodeIsland
14            Delaware
Total                0
dtype: object